           select relatorio assign to wid-relatorio
           organization is line sequential
           access mode is sequential
           file status is fs-clientes.
